# 2. Что такое Джанго? И почему он используется? 
# 4. В чёт суть паттерна и основной идеи DRY? Don’t repeat yourself. 
# 6. Что такое шаблоны в Django? Покажите пример шаблона и расскажите об их структуре. 
# 8. Каким образом к Django-backend можно подключить frontend react или vue? Что за библиотека и её предназначение? 
# 10. Что такое маршруты? Каким образом можно их строить в Django? Регулярные выражения? 
# 12. Какова функция параметра on_delete в поле ForeignKey? 
# 14. Что такое CRUD? 
 
# 16. Что такое django сигналы? Для чего их можно использовать? 
 
# 18. Что такое авторизация и аутентификация? Какие способы их использования есть в Django? 
 
# 20. Расскажите об утилите django-admin. 
 
# 22. Перечислите какие базы данных поддерживает Django? Как выполнить переключение между базой PostgreSQL и SQLite? 
 
# 24. Что за функция render (внутри django.shortcuts)? Что такое контекст? И что он передаёт и куда? 
 
# 26. В чём суть промежуточного(middleware) ПО в Django? Какие есть стандартные middleware и для чего они? 
 
# 28. Какие стили наследования есть в Python и какие из них использует Django. 
 
# 30. Что такое миксин? Напишите новый контроллер-класс и добавьте к нему одну из примесей. 
 
# 32. Как выполнить чистый SQL код внутри Python и Django? 
 
# 34. Что такое функция «django.shortcuts.render»? 
 
# 36. Что такое объект Q? Для чего он применяется и пару вариантов его использования.